; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	spectrograph5 - mode
	infrared1 - mode
	spectrograph3 - mode
	image4 - mode
	spectrograph2 - mode
	infrared0 - mode
	thermograph6 - mode
	Star0 - direction
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph6)
	(supports instrument1 spectrograph2)
	(supports instrument1 image4)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph5)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(pointing satellite1 Planet12)
	(have_image Phenomenon5 infrared0)
	(have_image Star6 image4)
	(have_image Star7 spectrograph3)
	(have_image Star8 spectrograph5)
	(have_image Planet9 spectrograph5)
	(have_image Phenomenon10 spectrograph3)
	(have_image Phenomenon11 spectrograph2)
	(have_image Phenomenon11 image4)
	(have_image Planet12 spectrograph3)
	(have_image Planet12 thermograph6)
))

)

; plan
1. (turn_to satellite1 groundstation2 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 11
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 11
3. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 11
4. (turn_to satellite1 phenomenon11 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon11)
   goals met: 0 of 11
5. (turn_to satellite0 groundstation4 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 11
6. (take_image satellite1 phenomenon11 instrument1 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 1 of 11
7. (take_image satellite1 phenomenon11 instrument1 image4)
   added: (have_image phenomenon11 image4)
   goals met: 2 of 11
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 11
9. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 2 of 11
10. (turn_to satellite0 phenomenon10 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 11
11. (take_image satellite0 phenomenon10 instrument0 spectrograph3)
   added: (have_image phenomenon10 spectrograph3)
   goals met: 3 of 11
12. (turn_to satellite0 phenomenon5 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 11
13. (take_image satellite0 phenomenon5 instrument0 infrared0)
   added: (have_image phenomenon5 infrared0)
   goals met: 4 of 11
14. (turn_to satellite0 planet12 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet12)
   goals met: 4 of 11
15. (take_image satellite0 planet12 instrument0 spectrograph3)
   added: (have_image planet12 spectrograph3)
   goals met: 5 of 11
16. (turn_to satellite0 star7 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star7)
   goals met: 5 of 11
17. (take_image satellite0 star7 instrument0 spectrograph3)
   added: (have_image star7 spectrograph3)
   goals met: 6 of 11
18. (turn_to satellite1 planet9 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet9)
   goals met: 6 of 11
19. (take_image satellite1 planet9 instrument1 spectrograph5)
   added: (have_image planet9 spectrograph5)
   goals met: 7 of 11
20. (turn_to satellite1 star6 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star6)
   goals met: 7 of 11
21. (take_image satellite1 star6 instrument1 image4)
   added: (have_image star6 image4)
   goals met: 8 of 11
22. (turn_to satellite1 star8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star8)
   goals met: 8 of 11
23. (take_image satellite1 star8 instrument1 spectrograph5)
   added: (have_image star8 spectrograph5)
   goals met: 9 of 11
24. (turn_to satellite1 planet12 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 planet12)
   goals met: 10 of 11
25. (take_image satellite1 planet12 instrument1 thermograph6)
   added: (have_image planet12 thermograph6)
   goals met: 11 of 11
